var des ={
	inches : "Definition: Use of the inch can be traced back as far as the 7th century. The first explicit definition we could find of its length was after 1066 when it was defined as the length of three barleycorns. This was not a satisfactory reference as barleycorn lengths vary naturally. The British Standards Institute defined the inch as 25.4mm in 1930 in the document \"Metric Units in Engineering: Going SI\". In March 1932 the American Standards Association were asked to rule on whether to adopt the same value (at the time the American inch was 1/.03937 mm which approximated to 25.400051 mm). Because the values were so close, and because Britain has already settled on that value, the ASA adopted this value on March 13, 1933.",
	meters: "Definition: 1 m is equivalent to 1.0936 yards, or 39.370 inches.Since 1983, the metre has been officially defined as the length of the path travelled by light in a vacuum during a time interval of 1/299,792,458 of a second.",
	feet: "Description: The foot is a unit of length used in the imperial and U.S. customary measurement systems, representing 1/3 of a yard, and is subdivided into twelve inches.",
	yard: "A unit of length equal to 3 feet; defined as 91.44 centimeters; originally taken to be the average length of a stride",
	millimeters: "Definition: The millimetre is a unit of length in the metric system, equivalent to one thousandth of a metre (the SI base unit of length).One meter was defined in 1983 by the 17th conference of weights and measures as “the length of the path travelled by light in vacuum during a time interval of 1/299 792 458 of a second” and the millimetre by definition is derived as being 1/1000th of that value",
	miles: "A unit of length equal to 1760 yards",
	kilometers: "Definition: The kilometre is unit of length in the metric system equivalent to one thousand metres.1Km is equivalent to 0.6214 miles.",
	centimeters: "Definition: The centimetre is a unit of length in the metric system, equal to one-hundredth of a metre. 1cm is equivalent to 0.39370 inches."
};
